<?php

namespace JBF\Controller;
use Think\Controller;

class AccountsController extends Controller {

    public function index(){

        //print_r($_POST);
        //2017-02-02
        $saledate = $_POST['saledate'];
        $saleshop = $_POST['saleshop'];

        $单号 = "XS170315%";
        //$单号 = "XS".date('ymd',time())."%";
        $门店 = '';

        $tSql ="SELECT T.销售单号,T.销售类型,T.商品名称,T.商品条码,T.折扣率,T.实售工费,T.实售金价,T.实售价,T.总重,T.金重,G.售价,G.净金重,G.总件重,G.加工费方式,G.加工费,G.产品
大类,G.主类,G.子类,C.C0218 AS 销售员, C.C0205 AS 门店, C.C0217 AS 会员编号, C.C0214 AS 会员名称 FROM(SELECT D.SaleID AS 销售单号,D.Type AS 销售类型,D.C0185 AS 商品名称,D.C0302 
AS 商品条码,D.C0306 AS 折扣率,D.C0318 AS 实售工费,D.C0317 AS 实售金价,D.C0303 AS 实售价,D.c0312 AS 总重, D.c0313 AS 金重 FROM ITSV.uZBSALE.dbo.v_jbf_xsd_detail AS D WHERE 
SaleID LIKE '{单号}') AS T LEFT JOIN 商品表 AS G ON T.商品条码 = G.条码号 LEFT JOIN ITSV.uZBSALE.dbo.C02 AS C ON T.销售单号 = C.C0201 {门店} ORDER BY T.销售单号";

        //WHERE C.C0205='OL珠宝解放路店'
        //WHERE C.C0205='OL珠宝司门口店'
        $tSql=str_replace('{门店}', $门店, $tSql);
        $tSql=str_replace('{单号}', $单号, $tSql);
        $result = querydb($tSql);
        //print_r($result);

        $lst = array();

        foreach($result as $temp)
        {
            $销售单号 = $temp['销售单号'];

            if(!array_key_exists($销售单号, $lst))
            {
                $lst[$销售单号] = array();

                $lst[$销售单号]["销售单号"] = $销售单号;

                $lst[$销售单号]["足金克重"]   = 0;
                $lst[$销售单号]["铂950克重"]  = 0;
                $lst[$销售单号]["足铂克重"]   = 0;
                $lst[$销售单号]["足银克重"]   = 0;
                $lst[$销售单号]["其它克重"]   = 0;
                $lst[$销售单号]["优惠金额"]   = 0;

                $lst[$销售单号]["黄金旧料"]   = 0;
                $lst[$销售单号]["铂950旧料"]  = 0;
                $lst[$销售单号]["足铂旧料"]   = 0;
                $lst[$销售单号]["金750旧料"]  = 0;
                $lst[$销售单号]["银饰旧料"]   = 0;
                $lst[$销售单号]["其它料克重"] = 0;

                $lst[$销售单号]["素金销售"]   = 0;
                $lst[$销售单号]["硬金销售"]   = 0;
                $lst[$销售单号]["黄金镶嵌"]   = 0;
                $lst[$销售单号]["铂金销售"]   = 0;
                $lst[$销售单号]["彩金销售"]   = 0;
                $lst[$销售单号]["素银销售"]   = 0;
                $lst[$销售单号]["银饰销售"]   = 0;
                $lst[$销售单号]["玉器销售"]   = 0;
                $lst[$销售单号]["镶嵌销售"]   = 0;
                $lst[$销售单号]["其它销售"]   = 0;

                $lst[$销售单号]["黄金旧料抵扣"]    = 0;
                $lst[$销售单号]["铂金旧料抵扣"]    = 0;
                $lst[$销售单号]["旧料抵扣"]   = 0;

                $lst[$销售单号]["销售员"]     = $temp['销售员'];
                $lst[$销售单号]["会员编号"]   = $temp['会员编号'];
                $lst[$销售单号]["会员姓名"]   = $temp['会员名称'];
                $lst[$销售单号]["会员积分"]   = 0;
                $lst[$销售单号]["门店"]       = $temp['门店'];
                $lst[$销售单号]["实付总额"]   = 0;
            }

            $产品大类 = $temp['产品大类'];
            $主类 = $temp['主类'];
            $子类 = $temp['子类'];
            $金重 = $temp['金重'];
            $总重 = $temp['总重'];

            $销售类型 = $temp['销售类型'];
            $商品名称 = $temp['商品名称'];
            $实售价   = $temp['实售价'];
            $实售工费 = $temp['实售工费'];

            //计算销售金重
            if($销售类型 == "销售" and $金重>0)
            {
                if($产品大类 == "SGL" and strstr($商品名称,"足金"))
                {
                    $lst[$销售单号]["足金克重"] += $金重;
                }
                elseif ($产品大类 == "SGL" and strstr($商品名称,"铂950"))
                {
                    $lst[$销售单号]["铂950克重"] += $金重;
                }
                elseif ($产品大类 == "SGL" and strstr($商品名称,"足铂"))
                {
                    $lst[$销售单号]["足铂克重"] += $金重;
                }
                elseif ($产品大类 == "SAG" and  $主类 == "银饰")
                {
                    $lst[$销售单号]["足银克重"] += $金重;
                }
                else
                {
                    $lst[$销售单号]["其它克重"] += $金重;
                }
            }

            //计算销退金重
            if($销售类型 == "销退" and $金重>0)
            {
                if($产品大类 == "SGL" and strstr($商品名称,"足金"))
                {
                    $lst[$销售单号]["足金克重"] -= $金重;
                }
                elseif ($产品大类 == "SGL" and strstr($商品名称,"铂950"))
                {
                    $lst[$销售单号]["铂950克重"] -= $金重;
                }
                elseif ($产品大类 == "SGL" and strstr($商品名称,"足铂"))
                {
                    $lst[$销售单号]["足铂克重"] -= $金重;
                }
                elseif ($产品大类 == "SAG" and  $主类 == "银饰")
                {
                    $lst[$销售单号]["足银克重"] -= $金重;
                }
                else
                {
                    $lst[$销售单号]["其它克重"] -= $金重;
                }
            }

            //销售类型为折扣
            if($销售类型 == "折扣")
            {
                $lst[$销售单号]["优惠金额"] += $实售价;
            }

            //销售类型为旧料
            if($销售类型 == "旧料")
            {
                if (strstr($商品名称,"足金"))
                {
                    $lst[$销售单号]["黄金旧料"] += $金重;
                    $lst[$销售单号]["黄金旧料抵扣"]  += $实售价;
                }
                elseif (strstr($商品名称,"铂950"))
                {
                    $lst[$销售单号]["铂950旧料"] += $金重;
                    $lst[$销售单号]["铂金旧料抵扣"]  += $实售价;
                }
                elseif (strstr($商品名称,"足铂"))
                {
                    $lst[$销售单号]["足铂旧料"] += $金重;
                    $lst[$销售单号]["铂金旧料抵扣"]  += $实售价;
                }
                elseif (strstr($商品名称,"金750"))
                {
                    $lst[$销售单号]["金750旧料"] += $金重;
                }
                elseif (strstr($商品名称,"足银"))
                {
                    $lst[$销售单号]["银饰旧料"] += $金重;
                }
                else
                {
                    $lst[$销售单号]["其它料克重"] += $金重;
                }

                $lst[$销售单号]["旧料抵扣"]  += $实售价;
            }

            //计算分类业绩
            if($销售类型 == "销售" or $销售类型 == "销退")
            {
                if ($主类 == "足金")
                {
                    $lst[$销售单号]["素金销售"]   += $实售价;
                }
                elseif ($主类 == "3D足金")
                {
                    $lst[$销售单号]["硬金销售"]   += $实售价;
                }
                elseif ($产品大类 == "SGL" and $主类 == "足金镶嵌")
                {
                    $lst[$销售单号]["素金销售"]   += ($实售价 - $实售工费);

                    $lst[$销售单号]["黄金镶嵌"]   += $实售工费;
                }
                elseif ($产品大类 == "SGN" and $主类 == "足金镶嵌")
                {
                    $lst[$销售单号]["黄金镶嵌"]   += $实售价;
                }
                elseif ($主类 == "铂金")
                {
                    $lst[$销售单号]["铂金销售"]   += $实售价;
                }
                elseif ($主类 == "彩金")
                {
                    $lst[$销售单号]["彩金销售"]   += $实售价;
                }
                elseif ($产品大类 == "SAG" and $主类 == "银饰")
                {
                    $lst[$销售单号]["素银销售"]   += $实售价;
                }
                elseif ($产品大类 == "YSL" and $主类 == "银饰")
                {
                    $lst[$销售单号]["银饰销售"]   += $实售价;
                }
                elseif ($主类 == "玉器")
                {
                    $lst[$销售单号]["玉器销售"]   += $实售价;
                }
                elseif ($主类 == "镶嵌")
                {
                    $lst[$销售单号]["镶嵌销售"]   += $实售价;
                }
                else
                {
                    $lst[$销售单号]["其它销售"]   += $实售价;
                }
            }

            $lst[$销售单号]["实付总额"] += $实售价;

            if($lst[$销售单号]["素金销售"]<> 0 and $lst[$销售单号]["黄金旧料抵扣"]<> 0)
            {
                $素金纯销售 = $lst[$销售单号]["素金销售"] + $lst[$销售单号]["黄金旧料抵扣"];
                if($素金纯销售 >0)
                {
                    $lst[$销售单号]["素金销售"] = $素金纯销售;
                    $lst[$销售单号]["旧料抵扣"] -= $lst[$销售单号]["黄金旧料抵扣"];
                    $lst[$销售单号]["黄金旧料抵扣"] = 0;
                } else {
                    $lst[$销售单号]["黄金旧料抵扣"] = $素金纯销售;
                    $lst[$销售单号]["旧料抵扣"] += $lst[$销售单号]["素金销售"];
                    $lst[$销售单号]["素金销售"] = 0;
                }
            }

            if($lst[$销售单号]["铂金销售"]<> 0 and $lst[$销售单号]["铂金旧料抵扣"]<> 0)
            {
                $铂金纯销售 = $lst[$销售单号]["铂金销售"] + $lst[$销售单号]["铂金旧料抵扣"];
                if($铂金纯销售 >0)
                {
                    $lst[$销售单号]["铂金销售"] = $铂金纯销售;
                    $lst[$销售单号]["旧料抵扣"] -= $lst[$销售单号]["铂金旧料抵扣"];
                    $lst[$销售单号]["铂金旧料抵扣"] = 0;
                } else {
                    $lst[$销售单号]["铂金旧料抵扣"] = $铂金纯销售;
                    $lst[$销售单号]["旧料抵扣"] += $lst[$销售单号]["铂金销售"];
                    $lst[$销售单号]["铂金销售"] = 0;
                }
            }

            //计算积分 素金和铂金 10元积1分 \ 其它品类 1元积1分
            $积分1档销售 = $lst[$销售单号]["素金销售"] + $lst[$销售单号]["铂金销售"];
            $积分2档销售 = $lst[$销售单号]["硬金销售"] + $lst[$销售单号]["黄金镶嵌"] + $lst[$销售单号]["彩金销售"] + $lst[$销售单号]["素银销售"] + $lst[$销售单号]["银饰销售"]
                + $lst[$销售单号]["玉器销售"]+ $lst[$销售单号]["镶嵌销售"] + $lst[$销售单号]["其它销售"];

            $lst[$销售单号]["会员积分"] = $积分1档销售 *  0.1 + $积分2档销售 * 1;
        }

        $this->assign('lst',$lst);
        $this->show();
    }
}